# StartCutShadowJoin Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ColumnInsideWallFailures..::..StartCutShadowJoin Property
BuiltInFailures..::..ColumnInsideWallFailures Class See Also
---
Two joined walls are in a position to allow automatic insert copying.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StartCutShadowJoin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StartCutShadowJoin As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StartCutShadowJoin {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ColumnInsideWallFailures Class
Autodesk.Revit.DB Namespace